# Basic processing for uk data sets

# Setup

## Imports

In [2]:
import pandas as pd
import numpy as np

## Parameters

In [3]:
UK1_DATASET = "../../../data/RQ2/raw/uk1.csv"
UK2_DATASET = "../../../data/RQ2/raw/uk2.csv"
UK3_DATASET = "../../../data/RQ2/raw/uk3.csv"
UK4_DATASET = "../../../data/RQ2/raw/uk4.csv"
UK5_DATASET = "../../../data/RQ2/raw/uk5.csv"
UK6_DATASET = "../../../data/RQ2/raw/uk6.csv"
UK7_DATASET = "../../../data/RQ2/raw/uk7.csv"
UK8_DATASET = "../../../data/RQ2/raw/uk8.csv"
UK9_DATASET = "../../../data/RQ2/raw/uk9.csv"
UK10_DATASET = "../../../data/RQ2/raw/uk10.csv"
UK11_DATASET = "../../../data/RQ2/raw/uk11.csv"
UK12_DATASET = "../../../data/RQ2/raw/uk12.csv"
UK13_DATASET = "../../../data/RQ2/raw/uk13.csv"
UK14_DATASET = "../../../data/RQ2/raw/uk14.csv"
UK15_DATASET = "../../../data/RQ2/raw/uk15.csv"


PROCESSED_JUST_UK_DATASET = "../../../data/RQ2/processed/just_uk_df.csv"
PROCESSED_UK_DATASET = "../../../data/RQ2/processed/uk_df.csv"

# Loading the Datasets

In [4]:
df1 = pd.read_csv(UK1_DATASET)
df2 = pd.read_csv(UK2_DATASET)
df3 = pd.read_csv(UK3_DATASET)
df4 = pd.read_csv(UK4_DATASET)
df5 = pd.read_csv(UK5_DATASET)
df6 = pd.read_csv(UK6_DATASET)
df7 = pd.read_csv(UK7_DATASET)
df8 = pd.read_csv(UK8_DATASET)
df9 = pd.read_csv(UK9_DATASET)
df10 = pd.read_csv(UK10_DATASET)
df11 = pd.read_csv(UK11_DATASET)
df12 = pd.read_csv(UK12_DATASET)
df13 = pd.read_csv(UK13_DATASET)
df14 = pd.read_csv(UK14_DATASET)
df15 = pd.read_csv(UK15_DATASET)

In [5]:
uk_raw_df = df1.append([df2, df3, df4, df5, df6, df7, df8, df9, df10, df11, df12, df13, df14, df15])
uk_raw_df.shape

(6730560, 10)

In [6]:
uk_raw_df.head()

,measure,location,sex,age,cause,metric,year,val,upper,lower
0,Deaths,North West England,Male,1 to 4,Diabetes mellitus,Number,1990,0.120019,0.165918,0.075943
1,Deaths,North West England,Female,1 to 4,Diabetes mellitus,Number,1990,0.171002,0.241339,0.095432
2,Deaths,North West England,Male,1 to 4,Diabetes mellitus,Percent,1990,0.001539,0.001846,0.000971
3,Deaths,North West England,Female,1 to 4,Diabetes mellitus,Percent,1990,0.002653,0.003215,0.001529
4,Deaths,North West England,Male,1 to 4,Diabetes mellitus,Rate,1990,0.061912,0.085589,0.039175

In [7]:
uk_raw_df['cause'].unique()

array(['Diabetes mellitus', 'Interpersonal violence'], dtype=object)

In [8]:
uk_raw_df['location'].nunique()

164

In [9]:
uk_raw_df.duplicated().sum()

0

In [10]:
uk_raw_df['measure'].unique()

array(['Deaths', 'Prevalence', 'Incidence', 'YLLs (Years of Life Lost)',
       'DALYs (Disability-Adjusted Life Years)',
       'YLDs (Years Lived with Disability)'], dtype=object)

In [11]:
just_uk_df = uk_raw_df[uk_raw_df['location'].str.match('United Kingdom')]
uk_all_df = uk_raw_df[~uk_raw_df['location'].str.match('United Kingdom')]
just_uk_df.head()

,measure,location,sex,age,cause,metric,year,val,upper,lower
1140,YLLs (Years of Life Lost),United Kingdom,Male,1 to 4,Diabetes mellitus,Number,1991,85.734123,117.239628,48.598641
1141,YLLs (Years of Life Lost),United Kingdom,Female,1 to 4,Diabetes mellitus,Number,1991,116.321322,161.365862,58.284220
1142,YLLs (Years of Life Lost),United Kingdom,Male,1 to 4,Diabetes mellitus,Percent,1991,0.001629,0.001848,0.000966
1143,YLLs (Years of Life Lost),United Kingdom,Female,1 to 4,Diabetes mellitus,Percent,1991,0.002779,0.003157,0.001447
1144,YLLs (Years of Life Lost),United Kingdom,Male,1 to 4,Diabetes mellitus,Rate,1991,5.422246,7.414809,3.073616

In [12]:
uk_all_df.location.nunique()

163

In [13]:
just_england_df = uk_raw_df[uk_raw_df['location'].str.match('England')]
uk_all_df = uk_all_df[~uk_all_df['location'].str.match('England')]
just_england_df.head()

,measure,location,sex,age,cause,metric,year,val,upper,lower
1026,YLLs (Years of Life Lost),England,Male,1 to 4,Interpersonal violence,Number,1990,1065.070378,1397.399262,798.420123
1027,YLLs (Years of Life Lost),England,Female,1 to 4,Interpersonal violence,Number,1990,791.134771,1013.202130,600.860895
1028,YLLs (Years of Life Lost),England,Male,1 to 4,Interpersonal violence,Percent,1990,0.024012,0.025164,0.022632
1029,YLLs (Years of Life Lost),England,Female,1 to 4,Interpersonal violence,Percent,1990,0.022184,0.023315,0.020656
1030,YLLs (Years of Life Lost),England,Male,1 to 4,Interpersonal violence,Rate,1990,82.077699,107.688016,61.528785

In [14]:
just_uk_df['location'].nunique()

1

In [15]:
just_england_df['location'].nunique()

1

In [16]:
uk_all_df['location'].nunique()

162

We have to deliberately choose regions desired to avoid overlap as geographic regions of the same areas on different levels has been provided for england. Below we remove the higher level region data and use the smaller regions within england for our analysis.

In [17]:
#Here we create a list of the larger regions in england so we can remove them from the data

england_higher_level_regions = ['North East England',
                               'North West England',
                               'Yorkshire and the Humber',
                               'West Midlands',
                               'East Midlands',
                               'East of England',
                               'Greater London',
                               'South East England',
                               'South West England']

uk_df = uk_all_df[~uk_all_df['location'].isin(england_higher_level_regions)]
uk_df.head()

,measure,location,sex,age,cause,metric,year,val,upper,lower
342,Deaths,South Tyneside,Male,1 to 4,Diabetes mellitus,Number,1990,0.002953,0.004717,0.001722
343,Deaths,South Tyneside,Female,1 to 4,Diabetes mellitus,Number,1990,0.005396,0.008377,0.002764
344,Deaths,South Tyneside,Male,1 to 4,Diabetes mellitus,Percent,1990,0.001572,0.002395,0.001032
345,Deaths,South Tyneside,Female,1 to 4,Diabetes mellitus,Percent,1990,0.002904,0.004187,0.001591
346,Deaths,South Tyneside,Male,1 to 4,Diabetes mellitus,Rate,1990,0.067572,0.107925,0.039391

In [18]:
uk_df['location'].nunique()

153

In [19]:
uk_df['location'].unique()

array(['South Tyneside', 'Rochdale', 'Halton', 'Cheshire East',
       'Liverpool', 'Hartlepool', 'Waltham Forest', 'Sunderland', 'Wigan',
       'Stockport', 'Darlington', 'Southwark', 'Tameside', 'Trafford',
       'Sutton', 'Cheshire West and Chester', 'Blackburn with Darwen',
       'Newcastle upon Tyne', 'Sefton', 'Knowsley', 'Salford',
       'Northumberland', 'Cumbria', 'Lancashire', 'Richmond upon Thames',
       'County Durham', 'Bolton', 'Tower Hamlets', 'North Tyneside',
       'Blackpool', 'Wandsworth', 'Westminster', 'Wirral',
       'Stockton-on-Tees', 'Bury', 'Manchester', 'Warrington',
       'St Helens', 'Oldham', 'Redcar and Cleveland', 'Gateshead',
       'Middlesbrough', 'Wales', 'Telford and Wrekin', 'Stoke-on-Trent',
       'Northern Ireland', 'Kirklees', 'Bradford', 'Isle of Wight',
       'Surrey', 'Scotland', 'West Berkshire', 'Leeds', 'Milton Keynes',
       'Swindon', 'Walsall', 'Windsor and Maidenhead', 'Torbay',
       'Bristol, City of', 'Sheffield', 'Bournemouth', 'Wolverhampton',
       'Hampshire', 'Warwickshire', 'Southampton',
       'Herefordshire, County of', 'North Yorkshire', 'Birmingham',
       'Bracknell Forest', 'Slough', 'Sandwell', 'Wakefield', 'Cornwall',
       'South Gloucestershire', 'Solihull', 'Dorset', 'Rotherham',
       'Devon', 'Shropshire', 'North Somerset', 'Worcestershire',
       'Gloucestershire', 'Oxfordshire', 'Wiltshire',
       'Bath and North East Somerset', 'Dudley', 'Wokingham', 'Doncaster',
       'Reading', 'Kingston upon Hull, City of', 'Coventry', 'Barnsley',
       'East Riding of Yorkshire', 'Buckinghamshire', 'Staffordshire',
       'Poole', 'York', 'North East Lincolnshire', 'West Sussex',
       'North Lincolnshire', 'Plymouth', 'Calderdale', 'Medway',
       'East Sussex', 'Kent', 'Portsmouth', 'Brighton and Hove',
       'Somerset', 'Camden', 'Bromley', 'Nottingham', 'Bedford', 'Bexley',
       'Central Bedfordshire', 'Leicester', 'Redbridge', 'Lambeth',
       'Suffolk', 'Lewisham', 'Merton', 'Hertfordshire', 'Hounslow',
       'Brent', 'Cambridgeshire', 'Newham', 'Essex', 'Northamptonshire',
       'Havering', 'Thurrock', 'Barking and Dagenham',
       'Kingston upon Thames', 'Hillingdon', 'Lincolnshire', 'Norfolk',
       'Peterborough', 'Harrow', 'Hackney', 'Haringey', 'Southend-on-Sea',
       'Rutland', 'Islington', 'Leicestershire', 'Luton', 'Derby',
       'Derbyshire', 'Nottinghamshire', 'Barnet', 'Enfield', 'Ealing',
       'Kensington and Chelsea', 'Croydon', 'Greenwich',
       'Hammersmith and Fulham'], dtype=object)

In [20]:
uk_df = uk_df.drop(['upper', 'lower'], axis=1)
uk_df.shape

(6279120, 8)

# Saving the Datasets

In [21]:
just_uk_df.to_csv(PROCESSED_JUST_UK_DATASET, index=False)
uk_df.to_csv(PROCESSED_UK_DATASET, index=False)